In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('SQLite_count_test_db.db')

In [3]:
data = {'Col1':['a','a','a','b','b','c','č','á','A','Č']}

In [4]:
df = pd.DataFrame(data)

In [5]:
df.to_sql(name='Tab1', con=conn, if_exists='replace')

In [6]:
tab1_df = pd.read_sql_query(sql = 'select * from tab1', con=conn)

In [7]:
tab1_df

   index Col1
0      0    a
1      1    a
2      2    a
3      3    b
4      4    b
5      5    c
6      6    č
7      7    á
8      8    A
9      9    Č

In [8]:
cursor = conn.cursor()
cursor.execute('''
SELECT COUNT(*) AS "Record_Count" FROM "Tab1"
''')
columns = [col[0] for col in cursor.description]
count1 = cursor.fetchall()
count1_df = pd.DataFrame(count1, columns=columns)
cursor.close()

In [9]:
count1

[(10,)]

In [10]:
count1_df

   Record_Count
0            10

In [11]:
cursor = conn.cursor()
cursor.execute('''
SELECT T0."Col1" AS "Col1",COUNT(*) AS "count" FROM "Tab1" T0 GROUP BY T0."Col1";
''')
columns = [col[0] for col in cursor.description]
count2 = cursor.fetchall()
count2_df = pd.DataFrame(count2, columns=columns)
cursor.close()

In [12]:
count2

[('A', 1), ('a', 3), ('b', 2), ('c', 1), ('á', 1), ('Č', 1), ('č', 1)]

In [13]:
count2_df

  Col1  count
0    A      1
1    a      3
2    b      2
3    c      1
4    á      1
5    Č      1
6    č      1

In [14]:
count2_df.sort_values('Col1', ascending=False)

  Col1  count
6    č      1
5    Č      1
4    á      1
3    c      1
2    b      2
1    a      3
0    A      1

In [15]:
cursor = conn.cursor()
cursor.execute('''
SELECT T0."Col1" AS "Col1",COUNT(*) AS "count" FROM "Tab1" T0 GROUP BY T0."Col1" ORDER BY "Col1" DESC;
''')
columns = [col[0] for col in cursor.description]
count3 = cursor.fetchall()
count3_df = pd.DataFrame(count3, columns=columns)
cursor.close()

In [16]:
count3

[('č', 1), ('Č', 1), ('á', 1), ('c', 1), ('b', 2), ('a', 3), ('A', 1)]

In [17]:
count3_df

  Col1  count
0    č      1
1    Č      1
2    á      1
3    c      1
4    b      2
5    a      3
6    A      1